Revit 2024 API
VertexPositionColored Constructor
 Constructs the vertex from a point and a color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public VertexPositionColored(
	XYZ position,
	ColorWithTransparency color
)
Visual Basic
Public Sub New ( _
	position As XYZ, _
	color As ColorWithTransparency _
)
Visual C++
public:
VertexPositionColored(
	XYZ^ position,
	ColorWithTransparency^ color
)
Parameters
position
Type: Autodesk.Revit.DB.XYZ
 The vertex's position.
color
Type: Autodesk.Revit.DB.ColorWithTransparency
 The vertex's color.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace